; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 943866 2 3 3 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	infrared1 - mode
	infrared2 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Star3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared2)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Planet7)
	(have_image Star5 image0)
	(have_image Phenomenon6 infrared1)
	(have_image Planet7 infrared1)
	(have_image Planet8 infrared2)
	(have_image Planet9 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star2)
   goals met: 1 of 7
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 7
4. (turn_to satellite1 star3 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star3)
   goals met: 1 of 7
5. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 1 of 7
6. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   goals met: 0 of 7
7. (turn_to satellite1 planet9 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet9)
   goals met: 0 of 7
8. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   goals met: 1 of 7
9. (take_image satellite1 planet9 instrument2 image0)
   added: (have_image planet9 image0)
   goals met: 2 of 7
10. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   goals met: 1 of 7
11. (turn_to satellite1 planet7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet7)
   goals met: 2 of 7
12. (turn_to satellite0 star4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star4)
   goals met: 2 of 7
13. (take_image satellite1 planet7 instrument2 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 3 of 7
14. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 3 of 7
15. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 2 of 7
16. (turn_to satellite0 star5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star5)
   goals met: 2 of 7
17. (take_image satellite1 planet8 instrument2 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 3 of 7
18. (take_image satellite0 star5 instrument0 image0)
   added: (have_image star5 image0)
   goals met: 4 of 7
19. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   goals met: 5 of 7
20. (turn_to satellite1 planet7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet7)
   goals met: 6 of 7
21. (turn_to satellite1 phenomenon6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon6)
   goals met: 5 of 7
22. (take_image satellite1 phenomenon6 instrument2 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 6 of 7
23. (turn_to satellite1 planet7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet7)
   goals met: 7 of 7
